name: "CIFAR10_full"
layers {
  name: "cifar"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    source: "cifar10-leveldb1/cifar-test-leveldb"
		mean_file: "mean.binaryproto"
    batch_size: 100
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1.
  weight_decay: 0.
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "learned1"
  type: LEARNED_NEURON
  bottom: "conv1"
  top: "conv1_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp1"
  type: CONVOLUTION
  bottom: "conv1_l"
  top: "cccp1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 160
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned1_1"
  type: LEARNED_NEURON
  bottom: "cccp1"
  top: "cccp1_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp2"
  type: CONVOLUTION
  bottom: "cccp1_l"
  top: "cccp2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 96
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned1_2"
  type: LEARNED_NEURON
  bottom: "cccp2"
  top: "cccp2_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "cccp2_l"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "drop3"
  type: DROPOUT
  bottom: "pool1"
  top: "pool1_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1_d"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1.
  weight_decay: 0.
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "learned2"
  type: LEARNED_NEURON
  bottom: "conv2"
  top: "conv2_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp3"
  type: CONVOLUTION
  bottom: "conv2_l"
  top: "cccp3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned2_1"
  type: LEARNED_NEURON
  bottom: "cccp3"
  top: "cccp3_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp4"
  type: CONVOLUTION
  bottom: "cccp3_l"
  top: "cccp4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned2_2"
  type: LEARNED_NEURON
  bottom: "cccp4"
  top: "cccp4_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "cccp4_l"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "drop6"
  type: DROPOUT
  bottom: "pool2"
  top: "pool2_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2_d"
  top: "conv3"
  blobs_lr: 1.
  blobs_lr: 2.
  weight_decay: 1.
  weight_decay: 0.
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "learned3"
  type: LEARNED_NEURON
  bottom: "conv3"
  top: "conv3_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp5"
  type: CONVOLUTION
  bottom: "conv3_l"
  top: "cccp5"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned3_1"
  type: LEARNED_NEURON
  bottom: "cccp5"
  top: "cccp5_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "cccp6"
  type: CONVOLUTION
  bottom: "cccp5_l"
  top: "cccp6"
  blobs_lr: 0.1
  blobs_lr: 0.1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 10
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "learned3_2"
  type: LEARNED_NEURON
  bottom: "cccp6"
  top: "cccp6_l"
  blobs_lr: 1
  blobs_lr: 1
  blobs_lr: 0
  learned_neuron_param {
    sums: 1
    type: "learnhalfmax"
    weight_filler1 {
      type: "dense_uniform"
      std: 0.5
    }
    weight_filler2 {
      type: "gaussian"
      std: 0.5
    }
    weight_filler3 {
      type: "constant"
      value: -1
    }
  }
}
layers {
  name: "pool3"
  type: POOLING
  bottom: "cccp6_l"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 1
  }
}
layers {
  name: "prob"
  type: SOFTMAX
  bottom: "pool3"
  top: "prob"
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "prob"
  bottom: "label"
  top: "accuracy"
}
