name: "CIFAR10_full"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
 	transform_param {
    mirror: true
    crop_size: 32
    mean_file: "mean.binaryproto"
  }
  data_param {
    source: "leveldb3/train-leveldb/"
    batch_size: 100
		backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 32
    mean_file: "mean.binaryproto"
  }
  data_param {
    source: "leveldb3/test-leveldb/"
    batch_size: 100
    backend: LMDB
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "apl1"
  type: "APL"
  bottom: "conv1"
  top: "conv1"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
	}
}
layer {
  name: "cccp1"
  type: "Convolution"
  bottom: "conv1"
  top: "cccp1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl2"
  type: "APL"
  bottom: "cccp1"
  top: "cccp1"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
	}
}
layer {
  name: "cccp2"
  type: "Convolution"
  bottom: "cccp1"
  top: "cccp2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl3"
  type: "APL"
  bottom: "cccp2"
  top: "cccp2"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
	}
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "cccp2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop3"
  type: "Dropout"
  bottom: "pool1"
  top: "pool1_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1_d"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "apl4"
  type: "APL"
  bottom: "conv2"
  top: "conv2"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "cccp3"
  type: "Convolution"
  bottom: "conv2"
  top: "cccp3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl5"
  type: "APL"
  bottom: "cccp3"
  top: "cccp3"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "cccp4"
  type: "Convolution"
  bottom: "cccp3"
  top: "cccp4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl6"
  type: "APL"
  bottom: "cccp4"
  top: "cccp4"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "cccp4"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "pool2"
  top: "pool2_d"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2_d"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "apl7"
  type: "APL"
  bottom: "conv3"
  top: "conv3"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "cccp5"
  type: "Convolution"
  bottom: "conv3"
  top: "cccp5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl8"
  type: "APL"
  bottom: "cccp5"
  top: "cccp5"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "cccp6"
  type: "Convolution"
  bottom: "cccp5"
  top: "cccp6"
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 0
  }
  convolution_param {
    num_output: 100
    group: 1
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "apl9"
  type: "APL"
  bottom: "cccp6"
  top: "cccp6"
	param {
		decay_mult: 10
	}
	param {
		decay_mult: 10
	}
  apl_param {
    sums: 1
    slope_filler {
      type: "uniform"
      min: -0.5
			max: 0.5
    }
    offset_filler {
      type: "gaussian"
      std: 0.5
    }
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "cccp6"
  top: "pool3"
  pooling_param {
    pool: AVE
    kernel_size: 8
    stride: 1
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "pool3"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "pool3"
  bottom: "label"
  top: "loss"
}
